app/views/visitors/index.html.erb

SELECT COUNT(*) FROM "users"
---
		<h1 id="title"><center>Welcome to Collooking</center></h1>
		<!-- <p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p> -->

SELECT "recipes".* FROM "recipes"
---
		<div id="all_recipes">
			<%recipe = Recipe.all%>