app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes"  WHERE "recipes"."user_id" = 3
---
<h3>Recipes:</h3>
<%recipe = Recipe.all%>