app/controllers/recipes_controller.rb

	def create
		@recipe = Recipe.new({:name => (params[:recipe])[:name], :level => (params[:recipe])[:level],
			:description => (params[:recipe])[:description], :instructions => (params[:recipe])[:instructions], :user_id => current_user})
		@recipe.user = current_user
		if @recipe.save
---
INSERT INTO "recipes" ("created_at", "description", "instructions", "level", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-12-04 01:33:35.249419"], ["description", "anfasnf"], ["instructions", "asfna"], ["level", 1], ["name", "Test"], ["updated_at", "2014-12-04 01:33:35.249419"], ["user_id", 5]]